{"label":0,"text":"Took my grand kids for first time at this location. Where I come from they skate, not here. Order took a long time, beef way undercooked, fries blah, chick strips not good. No one liked anything...server looked stoned."}
{"label":4,"text":"We love coming in two movies for the whole family for what it costs for a single ticket at AMC or Edwards.  The food is also reasonably priced not a gouge like the aforementioned chain theaters.  Do yourself a favor go see all you movies here !!"}
{"label":0,"text":"Wish I had seen these reviews before going. I will keep it simple. In my opinion this place is a total rip-of as far as the prices charged and the quality\/authenticity of the food served. I must say the portions were large, but i guess they have to get rid of the stuff somehow."}
{"label":4,"text":"i have been getting my hair cut here for 15 years.  Marjorie is amazing and priceless.  I am as picky about my hairstylist as i am my dentist or doctor.  I travel extensively for work and get compliments no matter where i travel.  Wouldn't go anywhere else!"}
{"label":0,"text":"Food is good, but customer service should be just as good. Very rude, not friendly makes you feel un welcome. Don't know how he stays in business. Will tell all people I know to never go there. Vegas is full of good markets and this is not one of them."}
{"label":4,"text":"We ate here last\\nMinute. This was the only place open late on a Sunday and I'm glad that we ended up\\nHere. The vibe is modern and comfortable. Very spacious and the food is more than bomb. The Lisa Lisa roll is a must! I would definitely eat here again esp since I visit monthly."}
{"label":0,"text":"I been going to this Walmart for the pass six years. I am sick and tired that this Walmart never has anything in stock and is messy! I can drive an extra 10 minutes to the one located at Ft Apache and W.Tropicana Ave and they have everything in stock and it's organized. I'm done with this place!!"}
{"label":4,"text":"We stopped here for a Friday night date night. It was our first visit and we'll definitely return! The food, the service, affordability and ambience are all excellent! On our \\\"keeper\\\" list for sure!"}
{"label":0,"text":"The food was not good.  The owner sat at the bar and badgered the employees and customers. I ordered the stuffed mushroom and they were mushy and flavorless.   The \\\"homemade\\\" gnocchi was brutal.  I think they may have frozen it and recooked it.  I am not sure how they are still open."}
{"label":4,"text":"Lisa gave me a great cut.  I am very fussy about my short hair.  At 60 years old I want a stylish haircut but not to look like I am trying to be 20.  Lisa found the perfect balance, a cute,fun cut, perfect for summer.  I've already scheduled another cut and highlights for later this summer."}
